In [3]:
import pandas as pd

import numpy as np

Q1. List any five functions of the pandas library with execution.

Ans: 1. Head and Tail
     2. DataFrame.info( )
     3. Dtypes
     4. Shape and Size
     5. describe( )

In [4]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#DataFrame with a new index that starts from 1 and increments by 2 for each row.


data = [("ford", "Endever" , "25 lakh") , ("Toyato" , "fortuner" , "40 lakh") , ("Mahindra" , "Thar" , "18 lakh"),
       ("tata" , "Harrier" , "25 lakh")]

df = pd.DataFrame(data, columns=("A" , "B" , "C"))

In [5]:
df

          A         B        C
0      ford   Endever  25 lakh
1    Toyato  fortuner  40 lakh
2  Mahindra      Thar  18 lakh
3      tata   Harrier  25 lakh

In [6]:
df.reindex([1,3,5])

        A         B        C
1  Toyato  fortuner  40 lakh
3    tata   Harrier  25 lakh
5     NaN       NaN      NaN

In [7]:
#Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#function should print the sum to the console.

#For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
#calculate and print the sum of the first three values, which is 60

data = [10, 20, 30, 40, 50]
df = pd.DataFrame(data , columns=['values'])
sum = df.iloc[0:3].sum()
print(sum)

values    60
dtype: int64

In [8]:
sum

values    60
dtype: int64

In [9]:
#Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#'Word_Count' that contains the number of words in each row of the 'Text' column.


data = ['Chennai super kings','Mumbai Indians','Kolkata knight riders','Royal challangers Bangalore']
df = pd.DataFrame(data , columns=['Text'])
x = df['Text'].str.count(' ')+1
df['Word_Count'] = x
df

                          Text  Word_Count
0          Chennai super kings           3
1               Mumbai Indians           2
2        Kolkata knight riders           3
3  Royal challangers Bangalore           3

In [10]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?


#The size property returns the number of elements in the DataFrame. The number of elements is the number of rows * the number of columns.

#shape attribute in Pandas enables us to obtain the shape of a DataFrame. For example, if a DataFrame has a shape of (80, 10) ,
#this implies that the DataFrame is made up of 80 rows and 10 columns of data.

Q6. Which function of pandas do we use to read an excel file?

Ans:-To read an excel file as a DataFrame, use the pandas read_excel() method

In [11]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#'Username' in df that contains only the username part of each email address.
#The username is the part of the email address that appears before the '@' symbol. For example, if the 
#email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
#function should extract the username from each email address and store it in the new 'Username' 
#column

emails = ['Munnabhaiya@gmail.com','Kaleenthipathi@gmail.com','Guddupandit@gmail.com','bablupandit@gmail.com']

df = pd.DataFrame(emails , columns=['Email'])

df['Username'] = df['Email'].str.split('@').str[0]
df

                      Email        Username
0     Munnabhaiya@gmail.com     Munnabhaiya
1  Kaleenthipathi@gmail.com  Kaleenthipathi
2     Guddupandit@gmail.com     Guddupandit
3     bablupandit@gmail.com     bablupandit

In [12]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. # Write a Python function that selects 
# all rows where the value in column 'A' is greater than 5 and the # value in column 'B' is less than 10. The 
# function should return a new DataFrame that contains only the # selected rows.

# For example, if df contains the following values:

import pandas as pd

data = {'A': [1,4,8,9], 'B': [8,2,7,1] , 'C': [2,7,4,9,]}
df = pd.DataFrame(data)
df
def selected_rows(df):
    selectedrows = df[(df['A'] > 5 )&(df['B'] < 10)]
    return selectedrows

df = selected_rows(df)
df

   A  B  C
2  8  7  4
3  9  1  9

In [19]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
# median, and standard deviation of the values in the 'Values' column
 
data = [45,78,23,46,32,10]
df = pd.DataFrame(data, columns=['Values'])
df

df.mean(),df.median() , df.std()

(Values    39.0
 dtype: float64,
 Values    38.5
 dtype: float64,
 Values    23.460605
 dtype: float64)

In [20]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
# should include the current day

data = {'Date': ['2022-01-01','2022-01-02','2022-01-03','2022-01-04','2022-01-05','2022-01-06','2022-01-07','2022-01-08','2022-01-09','2022-01-10'] ,
        'Sales': [100, 200, 150, 300, 250, 400, 350, 500, 450, 600]}

df = pd.DataFrame(data)

def moving_average(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df= df.sort_values('Date')
    lk = df['Sales'].rolling(window = 7, min_periods=1).mean()
    
    df['MovingAverage']=lk
    return df


df=moving_average(df)
df

        Date  Sales  MovingAverage
0 2022-01-01    100     100.000000
1 2022-01-02    200     150.000000
2 2022-01-03    150     150.000000
3 2022-01-04    300     187.500000
4 2022-01-05    250     200.000000
5 2022-01-06    400     233.333333
6 2022-01-07    350     250.000000
7 2022-01-08    500     307.142857
8 2022-01-09    450     342.857143
9 2022-01-10    600     407.142857

In [21]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
#column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
#Monday, Tuesday) corresponding to each date in the 'Date' column


data = {'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'],
        'Weekday':['Sunday','Monday','Tuesday','Wednesday','Thursday']}
df = pd.DataFrame(data)


df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [24]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'
import pandas as pd

# Example DataFrame
df = pd.DataFrame({
    'Date': ['2022-12-31', '2023-01-05', '2023-01-15', '2023-02-01'],
    'Value': [10, 20, 30, 40]
})

selected_rows = select_rows_in_date_range(df)
print(selected_rows)


def select_rows_in_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime type
    start_date = pd.to_datetime('2023-01-01')
    end_date = pd.to_datetime('2023-01-31')
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows

        Date  Value
1 2023-01-05     20
2 2023-01-15     30

 Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
 be imported


Ans: As Pandas is dependent on the NumPy library, we need to import this dependency